import pyodbc
import csv
from opencc import OpenCC

#=============================================================
Server = 'tcp:140.136.155.47,64873'
DBName = 'MovieTag'
ID = 'sa'
PWD = 'qazwsx'
Driver = '{ODBC Driver 18 for SQL Server}'
#=============================================================

def AllSQL(tSQL):
    try:
        conn = pyodbc.connect('DRIVER={};SERVER={};DATABASE={};ENCRYPT=yes;UID={};PWD={};TrustServerCertificate=yes;'.format(Driver,Server,DBName,ID,PWD))
        cursor = conn.cursor()
        cursor.execute(tSQL) 
        row = cursor.fetchall() 
        # RV = row[0]
        conn.close
        return row
    except:
        print("OneSQL Error:{}".format(tSQL))
        return False
    
st_chi = [
"不幸", "不錯", "方便", "正好", "自由", "冷靜", "辛苦", "幸運", "幸福", "便宜",
"勇敢", "很棒", "美妙", "耐心", "差", "恐怖", "恭喜", "臭", "高興", "假",
"偉大", "強", "笨", "惡", "痛", "傻", "愚蠢", "瘋狂", "樂", "熱",
"窮", "激動", "壞", "蠢", "歡", "驕傲", "傷害", "順利", "認真", "不敢",
"不對", "力量", "公平", "天才", "天使", "父母", "父親", "主", "主人", "囚犯",
"母親", "白人", "目標", "全力", "同性", "合法", "好人", "成就", "老爸", "老師",
"老實", "機會", "利用", "屁", "事業", "命令", "垃圾", "法律", "法庭", "玫瑰",
"信心", "冒險", "冠軍", "很漂亮", "政府", "政治", "炸彈", "皇上", "家", "家人",
"病", "病人", "神", "能力", "酒", "鬼", "唱歌", "基督", "婚姻", "婊子",
"甜心", "笨蛋", "被告", "規定", "距離", "黑人", "黑色", "傳統", "愛情", "新",
"罪", "運", "雷", "夢", "實際", "槍", "監獄", "種族", "精神", "敵人",
"戰", "戰場", "機密", "貓", "錯誤", "薪水", "禮", "醫院", "鯊魚", "藥",
"證據", "騙子", "魔戒", "魔鬼", "權", "媽", "戰爭", "時間", "證明", "兇",
"好奇", "安靜", "年輕", "成功", "有趣", "完美", "快樂", "邪惡", "乖", "帥",
"很好", "美好", "美麗", "重新", "容易", "健康", "寂寞", "清楚", "愉快", "棒",
"舒服", "意外", "慘", "漂亮", "緊急", "緊張", "厲害", "樂意", "遺憾", "優秀",
"糟糕", "聰明", "嚴重", "驚訝", "驚喜", "親愛", "正確", "努力", "不好", "反對",
"比較", "同意", "好好", "更好", "乖乖", "特", "真好", "真相", "真實", "亂",
"人生", "人類", "刀", "大麻", "大學", "子彈", "小心", "公主", "天堂", "月",
"代價", "兄弟", "奴隸", "民主", "甘地", "生氣", "生病", "光", "地獄", "好事",
"好消息", "老", "老人", "老闆", "老婆", "老爺", "老鼠", "血", "佛", "利",
"弟兄", "弟弟", "戒指", "投票", "命", "命運", "坦白", "妹妹", "性", "性感",
"武器", "法", "法官", "法院", "信任", "信仰", "保險", "勇氣", "勁", "客氣",
"屍體", "帝國", "毒品", "皇后", "皇帝", "美女", "美金", "計畫", "軍隊", "家庭",
"浪費", "消失", "消息", "狼", "神父", "祕密", "迷人", "酒吧", "酒店", "陛下",
"婚禮", "專家", "情", "教堂", "教會", "混蛋", "紳士", "責任", "猶太人", "黑鬼",
"傻瓜", "感情", "愛", "運氣", "遊戲", "道理", "瘋子", "精彩", "價值", "敵軍",
"暴力", "豬", "歷史", "辦法", "錯", "壓力", "禮物", "關心", "警告", "權力",
"權利", "靈魂", "有罪", "革命", "旅行", "救命", "教育", "勝利", "微笑", "影響",
"犯罪", "生", "生命", "合作", "威脅", "指控", "訓練", "教練乾淨", "不安", "不利",
"不通", "太美", "平安", "平等", "平衡", "合適", "成熟", "有效", "有感", "血腥",
"困惑", "沉默", "良心", "足", "佳", "奇妙", "孤單", "沮喪", "長大", "很美",
"很痛", "很貴", "很慘", "珍貴", "苦", "香", "容忍", "弱", "浪漫", "真美",
"神奇", "純", "強大", "強烈", "敏感", "混亂", "甜", "甜美", "累", "軟弱",
"野蠻", "最愛", "悲哀", "殘忍", "無聊", "無趣", "猶豫", "著名", "貴", "傲",
"暖", "暖和", "滑稽", "煩惱", "飽", "團結", "慷慨", "瘋", "豪華", "輕易",
"憤怒", "樂觀", "激烈", "險", "優雅", "糟", "艱難", "醜", "醜陋", "謹慎",
"豐富", "懶", "歡樂", "驚人", "嚴格", " 反對", "正直", "早該", "酷", "人性",
"人渣", "人間", "人種", "人質", "十字架", "友誼", "天父", "手榴彈", "手槍", "日落",
"毛病", "正義", "作弊", "利益", "妓女", "屁話", "抗議", "車禍", "受害者", "故障",
"屎", "疾病", "真棒", "神力", "高手", "高尚", "假裝", "野心", "陸戰", "陰影",
"陰謀", "間諜", "聖", "聖靈", "榮幸", "誤會", "障礙", "領先", "領袖", "廢話",
"暴徒", "戰艦", "懦夫", "癌症", "糞", "糟透了", "尊嚴", "悲傷", "悲慘", "殘酷",
"肅靜", "舒適", "慈悲", "溫柔", "誠實", "賤", "激怒", "親密", "尷尬", "穩",
"穩定", "嚴肅", "骯髒", "積極", "犯人", "怪物", "怪胎", "狗屁", "勇士", "叛徒",
"幽默感", "雜種", "騙人", "考驗", "免費", "抵抗", "娛樂", "問題", "重要", "最好",
"難", "錢", "工作", "生活",
]

if __name__ == "__main__":
    # # selected st_chi for st characteristic values
    # st_chi = []
    # word = AllSQL("SELECT word   FROM [movieDB].[dbo].[emo_st] WHERE word_count > 1000 AND word_count < 10000 AND ((tag <> 'x') AND (tag <> 'm') AND (tag = 'n') OR (tag = 'a') OR (tag = 'ad') OR (tag = 'vd') OR (tag = 'vn') OR (tag = 'd'));")
    # for i in word:
    #     for j in i:
    #         st_chi.append(j)
    # print(st_chi)
    



    # eliminate identical words
    # convert s2t
    cc = OpenCC('s2t')
    e_st_chi = []
    for word in st_chi:
        word = cc.convert(word)
        if word not in e_st_chi:
            e_st_chi.append(word)
        else:
            pass
    print(e_st_chi)

    # Split the list into chunks of 10 words
    chunks = [e_st_chi[i:i+10] for i in range(0, len(e_st_chi), 10)]

    # Print each chunk as a comma-separated list
    for chunk in chunks:
        print('", "'.join(chunk))
    print(len(e_st_chi))

    # print(st_chi.index("警告"))

    # with open(r'C:\Users\85270\OneDrive - 輔仁大學\桌面\Python\study\TID_charV.csv', 'r') as csvfile:
    #     csvreader = csv.reader(csvfile)
    #     print(type(csvreader))
    #     # print(csvreader[54][1][809])
    #     print(csvreader[:0])

